Revit 2026 API

# ComboBoxDropDownOpenedEventArgs Class

---

The event arguments used by ComboBox's DropDownOpened event.

SystemObject SystemEventArgs Autodesk.Revit.UI.EventsRibbonItemEventArgs Autodesk.Revit.UI.EventsComboBoxDropDownOpenedEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComboBoxDropDownOpenedEventArgs : RibbonItemEventArgs
```
```vb
Public Class ComboBoxDropDownOpenedEventArgs
	Inherits RibbonItemEventArgs
```
```cpp
public ref class ComboBoxDropDownOpenedEventArgs : public RibbonItemEventArgs
```
```fsharp
type ComboBoxDropDownOpenedEventArgs =
    class
        inherit RibbonItemEventArgs
    end
```

The ComboBoxDropDownOpenedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComboBoxDropDownOpenedEventArgs | Initializes a new instance of the ComboBoxDropDownOpenedEventArgs class |

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. (Inherited from RibbonItemEventArgs) |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace